//编译:
//		gcc ./c引用后移.c -g3 -o x

#include <stdio.h>

//c的引用后裔: 超级节省内存, 指针变量地址都省了(穿戴设备可能会这样用)
int main(void){
	int *p;
	int a[4] = {1,5,10,15};

	//一个字节=8bit; 64bit系统, 一个指针8字节;

	printf("%d\n",&a+0);			//每次后移动8 字节, 相当于指针数组后移动(这种用法废弃, 没啥实用意义)
	printf("%d\n",&a+1);
	printf("%d\n",&a+2);
	printf("%d\n",&a+3);

	printf("%d\n",&a[0]+0);		//每次移动4 字节, 相当于一个int(引用后移的正确写法)
	printf("%d\n",&a[0]+1);
	printf("%d\n",&a[0]+2);
	printf("%d\n",&a[0]+3);

	p = &a[0]+0;							//每次移动4 字节, 相当于一个int(指针和引用后移联用)
	printf("%d\n",p);
	p = &a[0]+1;
	printf("%d\n",p);
	p = &a[0]+2;
	printf("%d\n",*p);
	p = &a[0]+3;
	printf("%d\n",*p);

	return 0;
}



//总结
/*
	c 语言引用后移 = '&' + 数组[下标] + 偏移量;
	是一种十分节省内存的用法, 
	一般来说, c 语言引用后移, 都倾向于以a[0] 数组首地址为基准, 计算偏移量(其他非[0]下标做偏移基准, 用得比较少);
*/
